# Non Graded  Challenge 3
---
> Arief Luqmannurhakim
>
> Batch 001 -- FTDS

# Load dataframe
---

In [1]:
import sqlite3
import pandas as pd

In [2]:
!printf '%s\n' *

assessments.csv
courses.csv
hasil_record_data.xlsx
sample_data
studentAssessment.csv.zip
studentInfo.csv.zip
studentRegistration.csv.zip
vle.csv

In [3]:
list_data = ['courses.csv',
'studentAssessment.csv.zip',
'studentInfo.csv.zip',
'studentRegistration.csv.zip',
'vle.csv']

df = []

for i in list_data:
  if i[-1] == 'p' :
    df.append(pd.read_csv(i, compression='zip'))
  

  df.append(pd.read_csv(i))

In [4]:
for i in range(len(list_data)):
  print('\n\n')
  print(df[i].info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   code_module                 22 non-null     object
 1   code_presentation           22 non-null     object
 2   module_presentation_length  22 non-null     int64
dtypes: int64(1), object(2)
memory usage: 656.0+ bytes
None



<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173912 entries, 0 to 173911
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id_assessment   173912 non-null  int64
 1   id_student      173912 non-null  int64
 2   date_submitted  173912 non-null  int64
 3   is_banked       173912 non-null  int64
 4   score           173739 non-null  float64
dtypes: float64(1), int64(4)
memory usage: 6.6 MB
None



<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173912 entries, 0 to 173911
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id_assessment   173912 non-null  int64
 1   id_student      173912 non-null  int64
 2   date_submitted  173912 non-null  int64
 3   is_banked       173912 non-null  int64
 4   score           173739 non-null  float64
dtypes: float64(1), int64(4)
memory usage: 6.6 MB
None



<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   code_module           32593 non-null  object
 1   code_presentation     32593 non-null  object
 2   id_student            32593 non-null  int64
 3   gender                32593 non-null  object
 4   region                32593 non-null  object
 5   highest_education     32593 non-null  object
 6   imd_band              31482 non-null  object
 7   age_band              32593 non-null  object
 8   num_of_prev_attempts  32593 non-null  int64
 9   studied_credits       32593 non-null  int64
 10  disability            32593 non-null  object
 11  final_result          32593 non-null  object
dtypes: int64(3), object(9)
memory usage: 3.0+ MB
None



<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   code_module           32593 non-null  object
 1   code_presentation     32593 non-null  object
 2   id_student            32593 non-null  int64
 3   gender                32593 non-null  object
 4   region                32593 non-null  object
 5   highest_education     32593 non-null  object
 6   imd_band              31482 non-null  object
 7   age_band              32593 non-null  object
 8   num_of_prev_attempts  32593 non-null  int64
 9   studied_credits       32593 non-null  int64
 10  disability            32593 non-null  object
 11  final_result          32593 non-null  object
dtypes: int64(3), object(9)
memory usage: 3.0+ MB
None

In [5]:
df[3]

      code_module code_presentation  ...  disability final_result
0             AAA             2013J  ...           N         Pass
1             AAA             2013J  ...           N         Pass
2             AAA             2013J  ...           Y    Withdrawn
3             AAA             2013J  ...           N         Pass
4             AAA             2013J  ...           N         Pass
...           ...               ...  ...         ...          ...
32588         GGG             2014J  ...           N         Fail
32589         GGG             2014J  ...           N  Distinction
32590         GGG             2014J  ...           Y         Pass
32591         GGG             2014J  ...           N    Withdrawn
32592         GGG             2014J  ...           N  Distinction

[32593 rows x 12 columns]

# Create Database
---

In [6]:
table_csv = [
  'courses',
 'studentAssessment',
 'studentInfo',
 'studentRegistration',
 'vle']

In [7]:
db = sqlite3.connect('student_data.db') # Automatically creating database if doesn't exists in current directory

cur = db.cursor()
cur.execute(''' CREATE TABLE IF NOT EXISTS assessments(
  code_module text,
  code_presentation text,
  id_assessment integer NOT NULL,
  assessment_type text,
  date real,
  weight real
  
  );  ''')

cur.execute(''' INSERT INTO assessments (code_module, code_presentation, id_assessment, assessment_type, date, weight)
VALUES ('AAA', '2013J', 1752, 'TMA', 19.0, 10.0),
       ('GGG', '2014J', 37436, 'TMA', 124.0, 0.0),
       ('GGG', '2014J', 37444, 'Exam', 229.0, 100.0) ''')

cur.execute('SELECT * FROM assessments')

for x in cur.fetchall():
  print(x)

assesment_df = pd.read_csv('assessments.csv')
assesment_df.to_sql('assessments', db, if_exists='replace', index=False)

db.commit()
db.close()

('AAA', '2013J', 1752, 'TMA', 19.0, 10.0)
('GGG', '2014J', 37436, 'TMA', 124.0, 0.0)
('GGG', '2014J', 37444, 'Exam', 229.0, 100.0)

In [8]:
db = sqlite3.connect('student_data.db') # Automatically creating database if doesn't exists in current directory

for i in range(len(table_csv)):

  df[i].to_sql(table_csv[i], db, if_exists='replace', index=False)


db.commit()
db.close()

# Query database
---

In [9]:
db = sqlite3.connect('student_data.db')

df_query = pd.read_sql_query(
    ''' SELECT studentAssessment.id_student, vle.region, vle.code_presentation,  vle.code_module, assessments.assessment_type, studentAssessment.score
        FROM vle
        INNER JOIN studentAssessment ON vle.id_student = studentAssessment.id_student
        INNER JOIN assessments ON studentAssessment.id_assessment = assessments.id_assessment
        WHERE vle.code_presentation == "2014B"
        ; ''', db)
db.close()

In [10]:
df_query.head(100)

    id_student         region  ... assessment_type  score
0        25997  London Region  ...             TMA   73.0
1        25997  London Region  ...             CMA  100.0
2        27891       Scotland  ...             TMA   73.0
3        27891       Scotland  ...             TMA   67.0
4        27891       Scotland  ...             TMA   55.0
..         ...            ...  ...             ...    ...
95       78255   North Region  ...             TMA   76.0
96       78255   North Region  ...             TMA   76.0
97       78255   North Region  ...             TMA   63.0
98       78255   North Region  ...             CMA  100.0
99       88340          Wales  ...             TMA   63.0

[100 rows x 6 columns]

In [11]:
df_query.to_excel('hasil_record_data.xlsx')